package com.mentoring.sc.cyclePractice;
import java.util.Scanner;
/*
Написать программу, вычисляющую и отображающую все числа Фибоначчи меньше введённого пользователем целого числа.
Решить двумя способами: с помощью цикла и с помощью рекурсии.
 */

public class Task2 {


    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Input: ");
        int threshold = scanner.nextInt();

    }

    public static void fibonachchiPrinter(int end){
//        int first = 0;
//        int second = 1;
//        while(start <= end){
//            if(){}
//        }
    }

    public static void printer(int value){
        System.out.println(value);
    }
}
